---
type: ReferenceWithContext
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ReferenceWithContext

`Autodesk.Revit.DB.ReferenceWithContext` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetInstanceTransform | 2012 | `public Transform GetInstanceTransform ()` |
| Method | GetReference | 2012 | `public Reference GetReference ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Proximity | 2012 | `public double Proximity { get ; }` |